[
  {
    "id": 1,
    "authorId": 1,
    "title": "Мои любимые блины - история и советы",
    "content": "Хочу поделиться историей о том, как я научилась готовить идеальные блины! Это был долгий путь проб и ошибок.\n\nПервые мои блины получались комом - в прямом смысле слова. Они прилипали к сковороде, рвались и были похожи на всё что угодно, только не на блины.\n\nНо со временем я поняла несколько важных секретов:\n\n**Секрет 1:** Тесто должно отдохнуть минимум 30 минут. Это позволяет клейковине расслабиться и блины становятся эластичными.\n\n**Секрет 2:** Сковорода должна быть раскалённой! Первый блин всегда комом именно потому, что сковорода недостаточно горячая.\n\n**Секрет 3:** Масло нужно добавлять прямо в тесто, тогда не нужно смазывать сковороду каждый раз.\n\nТеперь мои блины всегда получаются тонкими, ажурными и очень вкусными! Попробуйте рецепт, который я прикрепила ниже.",
    "createdAt": "2024-11-15T10:30:00Z",
    "updatedAt": "2024-11-15T10:30:00Z",
    "images": [
      {
        "id": 1,
        "imageUrl": "https://placehold.co/800x600/ff6b6b/ffffff?text=Blini+Process+1",
        "displayOrder": 1
      },
      {
        "id": 2,
        "imageUrl": "https://placehold.co/800x600/4ecdc4/ffffff?text=Blini+Process+2",
        "displayOrder": 2
      },
      {
        "id": 3,
        "imageUrl": "https://placehold.co/800x600/95e1d3/ffffff?text=Final+Result",
        "displayOrder": 3
      }
    ],
    "recipes": [
      {
        "recipeId": 1,
        "displayOrder": 1
      }
    ]
  },
  {
    "id": 2,
    "authorId": 1,
    "title": "Осенний сезон - время для тыквы!",
    "content": "Осень - моё любимое время года для кулинарных экспериментов! И тыква - королева осени на моей кухне.\n\nВчера приготовила невероятный крем-суп из тыквы. Бархатистый, нежный, с лёгкими нотками имбиря и сливок. Это просто волшебство!\n\nТыква - это не только вкусно, но и полезно. Она богата витамином А, содержит антиоксиданты и помогает укрепить иммунитет перед холодами.\n\nДелюсь своим любимым рецептом тыквенного крем-супа. Готовится легко, а результат превосходит все ожидания!",
    "createdAt": "2024-11-16T14:20:00Z",
    "updatedAt": "2024-11-16T14:20:00Z",
    "images": [
      {
        "id": 4,
        "imageUrl": "https://placehold.co/800x600/f38181/ffffff?text=Pumpkin+Soup",
        "displayOrder": 1
      }
    ],
    "recipes": [
      {
        "recipeId": 3,
        "displayOrder": 1
      }
    ]
  },
  {
    "id": 3,
    "authorId": 1,
    "title": "Завтрак чемпионов",
    "content": "Доброе утро, друзья! 🌅\n\nСегодня хочу поговорить о важности правильного завтрака. Утро задаёт тон всему дню, и правильный завтрак - это залог продуктивности и хорошего настроения.\n\nЯ собрала для вас подборку своих любимых рецептов для завтрака. Это и классические блины, и пышные панкейки. Все рецепты простые, но очень вкусные!\n\nПопробуйте начать своё утро с чего-то особенного, и вы заметите, как изменится ваш день!",
    "createdAt": "2024-11-17T08:00:00Z",
    "updatedAt": "2024-11-17T08:00:00Z",
    "images": [],
    "recipes": [
      {
        "recipeId": 1,
        "displayOrder": 1
      },
      {
        "recipeId": 2,
        "displayOrder": 2
      }
    ]
  },
  {
    "id": 4,
    "authorId": 2,
    "title": "Секреты профессиональной кухни",
    "content": "Привет, друзья! Сегодня расскажу вам несколько профессиональных секретов, которые помогут вам готовить как шеф-повар.\n\n**Mis en place** - это французский термин, который означает \"всё на своих местах\". Прежде чем начать готовить, подготовьте все ингредиенты: помойте, почистите, нарежьте. Это сэкономит время и избавит от стресса в процессе готовки.\n\n**Температура имеет значение** - мясо должно быть комнатной температуры перед приготовлением, масло для жарки должно быть горячим, а для выпечки все ингредиенты должны быть одной температуры.\n\n**Соль в несколько этапов** - профессиональные повара солят блюдо на каждом этапе приготовления, а не только в конце. Это раскрывает вкус каждого ингредиента.\n\nПрименяйте эти принципы, и ваши блюда станут намного вкуснее!",
    "createdAt": "2024-11-18T16:45:00Z",
    "updatedAt": "2024-11-18T16:45:00Z",
    "images": [
      {
        "id": 5,
        "imageUrl": "https://placehold.co/800x600/a8e6cf/ffffff?text=Kitchen+Setup",
        "displayOrder": 1
      }
    ],
    "recipes": []
  }
]
